import streamlit as st

st.title('Welcome to predict👻🙈')

st.header('_คำอธิบาย_',divider='rainbow')
multi = '''    การเก็บข้อมูลปริญญานิพนธ์และการวิเคราะห์บทคัดย่อเป็นกระบวนการที่สำคัญและเชื่อถือได้ เพื่อให้สามารถทำนายหรือประมวลผลข้อมูลได้อย่างมีประสิทธิภาพ
การใช้เทคโนโลยีทางด้านปัญญาประดิษฐ์เพื่อช่วยในการวิเคราะห์ข้อมูลเหล่านี้มีความสำคัญอย่างมากในการปรับปรุงกระบวนการการบริหารจัดการข้อมูล 
โดยเฉพาะในสถาบันการศึกษาที่มีปริญญานิพนธ์เป็นส่วนหนึ่งของการศึกษา  และที่สำคัญเพื่อการตัดสินใจทำโปรเจคของเพื่อนๆ'''
st.markdown(multi)